app/Controllers/Kategori.php

    public function index()
    {
        $keyword = $this->request->getGet('keyword');

        $builder = $this->kategori;

        if ($keyword) {
            $builder = $builder->like('nama_kategori', $keyword);
        }

        $data['kategori'] = $builder->paginate(10);
---
SELECT *
FROM `kategori`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `kategori`