app/Controllers/Penulis.php

    public function index()
    {
        $keyword = $this->request->getGet('keyword');

        $builder = $this->penulis;

        if ($keyword) {
            $builder = $builder->like('nama_penulis', $keyword);
        }

        $data['penulis'] = $builder->paginate(10);
---
SELECT *
FROM `penulis`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `penulis`